Repository: ATIX-AG/hammer-cli
Catalog: locale/*/hammer-cli.po
Languages: ca

source: "Unable to find hostname in #{service_uri}"
ca: "No es pot trobar el nom d'amfitrió a #{service_uri}"

source: CA certificate for %{uri} was stored to %{file}
ca: L'AC del certificat per %{uri} ha estat emmagatzemat a %{file}

source: Now hammer can use the downloaded certificate to verify SSL connection to the server.
ca: Ara hammer pot utilitzar el certificat baixat per verificar la connexió SSL al servidor.

source: It will be used automatically when ssl_ca_path and ssl_ca_file options are not set.
ca: S'utilitzarà automàticament quan no estiguin establertes les opcions ssl_ca_path i ssl_ca_file.

source: Be aware that hammer cannot verify whether the certificate is correct and you should verify its authenticity.
ca: Tingueu en compte que hammer no pot verificar si el certificat és correcte i heu de verificar la seva autenticitat.

source: You can display the certificate content with
ca: Podeu visualitzar el contingut del certificat amb

source: As root you can also install the certificate and update the system-wide list of trusted CA certificates as follows:
ca: Com a root, també podeu instal·lar el certificat i actualitzar la llista de certificats d'AC de confiança a tot el sistema de la manera següent:

source: Couldn't parse URI '%s'.
ca: No s'ha pogut analitzar l'URI '%s'.

source: The CA certificate for %{uri} couldn't be downloaded. No CA cert was found.
ca: No s'ha pogut baixar l'AC per %{uri}. No s'ha trobat cap certificat d'AC.

source: Make sure your server sends cert chain including the CA.
ca: Assegureu-vos que el vostre servidor envia la cadena del certificat, incloent-hi l'AC.

source: To see the actual chain you can use openssl command
ca: Per veure la cadena real, podeu utilitzar l'ordre openssl

source: "You can also download the certificate manually and store it as #{cert_file}"
ca: "També podeu baixar el certificat manualment i emmagatzemar-lo com a #{cert_file}"

source: If you choose any other location set the ssl_ca_path or ssl_ca_file configuration options appropriately.
ca: Si trieu qualsevol altra ubicació, establiu adequadament les opcions de configuració ssl_ca_path o ssl_ca_file.

source: Fetching the CA certificate failed:
ca: Ha fallat la captura del certificat de l'AC:

source: The service at the given URI does not accept SSL connections
ca: El servei a l'URI donat no accepta connexions SSL

source: Perhaps you meant to connect to '%s'?
ca: Potser voleu connectar-vos a '%s'?

source: too many arguments
ca: massa arguments

source: option '%<option>s' is required
ca: es requereix l'opció '%<option>s'

source: option '%<option>s' (or env %<env>s) is required
ca: es requereix l'opció '%<option>s' (o env %<env>s)

source: option '%<switch>s': %<message>s
ca: opció '%<switch>s': %<message>s

source: parameter '%<param>s': %<message>s
ca: paràmetre '%<param>s': %<message>s

source: Unrecognised option '%<switch>s'
ca: Opció no reconeguda '%<switch>s'

source: No such sub-command '%<name>s'
ca: No hi ha la suborde '%<name>s'

source: no value provided
ca: no s'ha proporcionat cap valor

source: Illegal quoting in %{buffer}
ca: cometes no permeses a %{buffer}

source: Couldn't create %s. Please create the directory before setting defaults.
ca: No s'ha pogut crear %s. Creeu el directori abans d'establir els valors predeterminats.

source: Defaults management
ca: Gestió dels per defecte

source: List all the providers
ca: Llista tots els proveïdors

source: Provider
ca: Proveïdor

source: Supported defaults
ca: Els per defecte que són compatibles

source: Description
ca: Descripció

source: List all the default parameters
ca: Llista tots els paràmetres per defecte

source: Parameter
ca: Paràmetre

source: Value
ca: Valor

source: Delete a default param
ca: Suprimeix un paràmetre per defecte

source: The name of the default option
ca: El nom de l'opció per defecte

source: Add a default parameter to config
ca: Afegeix un paràmetre per defecte a la configuració

source: The name of the default option (e.g. organization_id).
ca: El nom per a l'opció per defecte (p. ex. organization_id).

source: The value for the default option
ca: El valor per a l'opció per defecte

source: The name of the provider providing the value. For list available providers see `hammer defaults providers`.
ca: El nom del proveïdor que proporciona el valor. Per a la llista dels proveïdors disponibles, vegeu `hammer defaults providers`.

source: Added %{key_val} default-option with value that will be generated from the server.
ca: S'ha afegit l'opció per defecte %{key_val} amb el valor que es generarà des del servidor.

source: Added %{key_val} default-option with value %{val_val}.
ca: S'ha afegit l'opció per defecte %{key_val} amb el valor %{val_val}.

source: Provider %{name} was not found. See `hammer defaults providers` for available providers.
ca: No s'ha trobat el proveïdor %{name}. Consulteu `hammer defaults providers` per als proveïdors disponibles.

source: The param name is not supported by provider. See `hammer defaults providers` for supported params.
ca: El nom del paràmetre no està admès pel servidor. Vegeu `hammer defaults providers` per als paràmetres admesos.

source: %{param} was deleted successfully.
ca: S'ha eliminat correctament %{param}.

source: You must specify value or a provider name, can't specify both.
ca: Heu d'especificar el valor o el nom del proveïdor, però no podeu especificar ambdós.

source: Couldn't find the requested param in %s.
ca: No s'ha pogut trobar el paràmetre sol·licitat a %s.

source: See: '%{path} --help'
ca: Vegeu: '%{path} --help'

source: SSL error
ca: Error SSL

source: SSL certificate verification failed
ca: La verificació del certificat SSL ha fallat

source: is the server down?
ca: Ha caigut el servidor?

source: was '%s' run on the server when using apipie cache? (typical production settings)
ca: Es va executar '%s' al servidor quan s'utilitzava la memòria cau d'apipie? (ajustos típics de producció)

source: Could not load the API description from the server
ca: No s'ha pogut carregar la descripció de l'API des del servidor

source: Missing arguments for %s
ca: Falten argument per %s

source: Format output in markdown
ca: Formata la sortida amb markdown

source: Hammer CLI help
ca: Ajuda del client de línia d'ordres de hammer

source: Print help for all hammer commands
ca: Imprimeix l'ajuda per a les ordres de hammer

source: No permissions to create log dir %s
ca: Sense els permisos per crear el directori del registre %s

source: File %s not writeable, won't log anything to the file!
ca: No es pot escriure al fitxer %s, no s'enregistrarà res al fitxer!

source: be verbose
ca: mostra informació detallada

source: show debugging output
ca: mostra la sortida de depuració

source: force reload of Apipie cache
ca: força la recàrrega de la memòria cau d'Apipie

source: path to custom config file
ca: camí al fitxer de configuració personalitzat

source: username to access the remote system
ca: nom d'usuari per accedir al sistema remot

source: password to access the remote system
ca: contrasenya per accedir al sistema remot

source: remote system address
ca: adreça del sistema remot

source: Configure SSL verification of remote system
ca: Configura la verificació SSL del sistema remot

source: Configure the file containing the CA certificates
ca: Configura el fitxer que conté els certificats d'AC

source: Configure the directory containing the CA certificates
ca: Configura el directori que conté els certificats d'AC

source: Configure the client's public certificate
ca: Configura el certificat públic del client

source: Configure the client's private key
ca: Configura la clau privada del client

source: Use standard authentication in addition to client certificate authentication
ca: Utilitza l'autenticació estàndard a més de l'autenticació del certificat del client

source: Fetch CA certificate from server and exit
ca: Captura el certificat d'AC del servidor i surt

source: show version
ca: mostra la versió

source: unknown version
ca: versió desconeguda

source: Show ids of associated resources
ca: Mostra els ID dels recursos associats

source: Explicitly turn interactive mode on/off
ca: Explícitament encén o apaga el mode interactiu

source: Output as CSV (same as --output=csv)
ca: Sortida com a CSV (el mateix que --output=csv)

source: Set output format. One of [%s]
ca: Estableix el format de sortida. Un de [%s]

source: Character to separate the values
ca: Caràcter per separar els valors

source: Get list of possible endings
ca: Obtén la llista dels finals possibles

source: Legacy configuration of modules detected. Check section about configuration in user manual
ca: S'ha detectat la configuració del llegat dels mòduls. Consulteu la secció quant a la configuració al manual d'usuari

source: Warning: An error occured while loading module %s
ca: Advertència: S'ha produït un error mentre es carregava el mòdul %s

source: Error: Some of the required modules are disabled in configuration: %s
ca: Error: Alguns dels mòduls requerits estan inhabilitats en la configuració: %s

source: Comma-separated list of key=value.
ca: Llista separada per comes de clau=valor.

source: value must be defined as a comma-separated list of key=value or valid JSON
ca: el valor s'ha de definir com una llista separada per comes de clau=valor o un JSON vàlid

source: Comma separated list of values. Values containing comma should be quoted or escaped with backslash
ca: Llista de valors separada per comes. Els valors que contenen comes s'han d'escriure entre cometes o amb l'escapament de la barra invertida

source: numeric value is required
ca: es requereix un valor numèric

source: One of true/false, yes/no, 1/0.
ca: Un de true/false, yes/no, 1/0.

source: value must be one of true/false, yes/no, 1/0
ca: el valor ha de ser un de true/false, yes/no, 1/0

source: Unable to parse JSON input
ca: No es pot analitzar sintàcticament l'entrada de JSON

source: Possible value(s): %s
ca: Valors possibles: %s

source: value must be %s
ca: el valor ha de ser %s

source: value must be one of %s
ca: el valor ha de ser un de %s

source: Date and time in YYYY-MM-DD HH:MM:SS or ISO 8601 format
ca: Data i hora en format YYYY-MM-DD HH:MM:SS o ISO 8601

source: '%s' is not a valid date
ca: '%s' no és una data vàlida

source: Any combination (comma separated list) of '%s'
ca: Qualsevol combinació (llista separada per comes) de '%s'

source: value must be a combination of '%s'
ca: el valor ha de ser una combinació de '%s'

source: Warning: Option %{option} is deprecated. %{message}
ca: Advertència: L'opció %{option} està en desús. %{message}

source: Deprecated: %{deprecated_msg}
ca: Obsolet: %{deprecated_msg}

source: %{flag} is deprecated: %{deprecated_msg}
ca: %{flag} és obsolet: %{deprecated_msg}

source: Can be specified multiple times.
ca: Es pot especificar múltiples vegades.

source: Default:
ca: Per defecte:

source: , or
ca: , o

source: Message
ca: Missatge

source: Name
ca: Nom

source: Page %{page} of %{total} (use --page and --per-page for navigation)
ca: Pàgina %{page} de %{total} (utilitzeu --page i --per-page per a la navegació)

source: yes
ca: si

source: Warning: location hammer.modules.d is deprecated, move your module configurations to cli.modules.d
ca: Advertència: la ubicació hammer.modules.d està en desús, moveu les configuracions dels vostres mòduls a cli.modules.d

source: Warning: Couldn't load configuration file %{path}: %{message}
ca: Advertència: no s'ha pogut carregar el fitxer de configuració %{path}: %{message}

source: Print help for commands
ca: Imprimeix l'ajuda per a les ordres

source: Exit interactive shell
ca: Surt del shell interactiu

source: Welcome to the hammer interactive shell
ca: Benvingut al shell interactiu de hammer

source: Type 'help' for usage information
ca: Teclegeu 'help' per a la informació de l'ús

source: Interactive shell
ca: Shell interactiu

source: SSL client certificate is set but the key is not
ca: S'ha establert el certificat de client SSL, però no la clau

source: SSL client key is set but the certificate is not
ca: S'ha establert la clau de client SSL, però no el certificat

source: SSL client authentication disabled
ca: S'ha inhabilitat l'autenticació de client SSL

source: Could't read SSL client certificate %s
ca: No s'ha pogut llegir el certificat de client SSL %s

source: Could't read SSL client key %s
ca: No s'ha pogut llegir la clau de client SSL %s

source: can't replace subcommand %<name>s (%<existing_class>s) with %<name>s (%<new_class>s)
ca: no es pot substituir la subordre %<name>s (%<existing_class>s) amb %<name>s (%<new_class>s)

source: Unknown option name '%s'
ca: Nom desconegut d'opció '%s'

source: You can't set all options %s at one time
ca: No podeu establir totes les opcions %s alhora

source: Options %s are required
ca: Es requereixen %s opcions

source: You can't set option %s
ca: No podeu establir l'opció %s

source: Option %s is required
ca: Cal l'opció %s

source: You can't set any of options %s
ca: No podeu establir cap de les opcions %s

source: At least one of options %s is required
ca: Com a mínim es requereix una de les opcions %s

source: One of options %s is required
ca: Cal una de les opcions %s

source: Only one of options %s can be set
ca: Només es pot establir una de les opcions %s
